:PROPERTIES:
:ID:       222093AC-E4FC-4E90-B124-ADFFC31F6314
:END:
#+title: emacs-lisp

* Help
** Describe Things
*** describe-function

#+begin_src emacs-lisp
  (describe-function #'describe-function)
#+end_src

#+RESULTS:
#+begin_example
describe-function is an autoloaded interactive byte-code-function in
‘help-fns.el’.

It is bound to C-h f, <f1> f and <help> f.
It can also be invoked from the menu: Help → Describe → Describe
Function....

(describe-function FUNCTION)

Display the full documentation of FUNCTION (a symbol).
When called from Lisp, FUNCTION may also be a function object.

See the ‘help-enable-symbol-autoload’ variable for special
handling of autoloaded functions.

  Probably introduced at or before Emacs version 22.1.

#+end_example

*** describe-mode

#+begin_src emacs-lisp
  (describe-function #'describe-mode)
#+end_src

#+RESULTS:
#+begin_example
describe-mode is an autoloaded interactive byte-code-function in
‘help-fns.el’.

It is bound to C-h m, <f1> m and <help> m.
It can also be invoked from the menu: Help → Describe → Describe
Buffer Modes.

(describe-mode &optional BUFFER)

Display documentation of current major mode and minor modes.
A brief summary of the minor modes comes first, followed by the
major mode description.  This is followed by detailed
descriptions of the minor modes, each on a separate page.

For this to work correctly for a minor mode, the mode’s indicator
variable (listed in ‘minor-mode-alist’) must also be a function
whose documentation describes the minor mode.

If called from Lisp with a non-nil BUFFER argument, display
documentation for the major and minor modes of that buffer.

When ‘describe-mode-outline’ is non-nil, Outline minor mode
is enabled in the Help buffer.

  Probably introduced at or before Emacs version 29.1.

#+end_example

*** describe-package
:PROPERTIES:
:ID:       3DB5F595-EE3B-4DD7-BC98-E42E8DC69F4D
:END:

#+begin_src emacs-lisp
  (describe-function #'describe-package)
#+end_src

#+RESULTS:
#+begin_example
describe-package is an autoloaded interactive byte-code-function in
‘package.el’.

It is bound to C-h P, <f1> P and <help> P.
It can also be invoked from the menu: Help → Describe → Describe
Package....

(describe-package PACKAGE)

Display the full documentation of PACKAGE (a symbol).

  Probably introduced at or before Emacs version 24.1.

#+end_example

**** mw/describe-package

describe-package unfortunately jams the information into a fairly
presumptuous spot and the function it calls just inserts the content
where it iss invoked, so instead I'll just create a middle ground that
captures and returns that content.

#+begin_src emacs-lisp
  (defun mw/describe-package (package)
    (with-temp-buffer
      (describe-package-1 package)
      (buffer-string)))
#+end_src

#+RESULTS:
: mw/describe-package

#+begin_src emacs-lisp
  (mw/describe-package 'async)
#+end_src

#+RESULTS:
#+begin_example
     Status: Installed in ‘async-20260318.1803/’ (unsigned). Delete
    Version: 20260318.1803
     Commit: 5faab28916603bb324d9faba057021ce028ca847
    Summary: Asynchronous processing in Emacs.
   Requires: emacs-24.4
    Website: https://github.com/jwiegley/emacs-async
   Keywords: async 
 Maintainer: Thierry Volpiatto <thievol@posteo.net>
     Author: John Wiegley <jwiegley@gmail.com>
Other versions: 20260318.1803 (melpa), 1.9.9 (melpa-stable), 1.9.9 (gnu).

Adds the ability to call asynchronous functions and process with ease.  See
the documentation for `async-start' and `async-start-process'.
#+end_example

*** describe-variable

#+begin_src emacs-lisp
  (describe-function #'describe-variable)
#+end_src

#+RESULTS:
#+begin_example
describe-variable is an autoloaded interactive byte-code-function in
‘help-fns.el’.

It is bound to C-h v, <f1> v and <help> v.
It can also be invoked from the menu: Help → Describe → Describe
Variable....

(describe-variable VARIABLE &optional BUFFER FRAME)

Display the full documentation of VARIABLE (a symbol).
Returns the documentation as a string, also.
If VARIABLE has a buffer-local value in BUFFER or FRAME
(default to the current buffer and current frame),
it is displayed along with the global value.

  Probably introduced at or before Emacs version 27.1.

#+end_example

** Discover Things
*** shortdoc

#+begin_src emacs-lisp
  (describe-function #'shortdoc)
#+end_src

#+RESULTS:
: shortdoc is an alias for ‘shortdoc-display-group’ in ‘shortdoc.el’.
: 
: (shortdoc GROUP &optional FUNCTION SAME-WINDOW)
: 
: Pop to a buffer with short documentation summary for functions in GROUP.
: Interactively, prompt for GROUP.
: If FUNCTION is non-nil, place point on the entry for FUNCTION (if any).
: If SAME-WINDOW, don’t pop to a new window.
: 
* Debugging
** message

#+begin_src emacs-lisp
  (describe-function #'message)
#+end_src

#+RESULTS:
#+begin_example
message is a primitive-function in ‘src/editfns.c’.

(message FORMAT-STRING &rest ARGS)

Declared type: (function ((or string null) &rest t) (or string null))

Display a message at the bottom of the screen.
The message also goes into the ‘*Messages*’ buffer, if ‘message-log-max’
is non-nil.  (In keyboard macros, that’s all it does.)
Return the message.

In batch mode, the message is printed to the standard error stream,
followed by a newline.

If the variable ‘inhibit-message’ is non-nil, the message is not
displayed, only logged in the ‘*Messages*’ buffer.

The first argument is a format control string, and the rest are data
to be formatted under control of the string.  Percent sign (%), grave
accent (`) and apostrophe (') are special in the format; see
‘format-message’ for details.  To display STRING without special
treatment, use (message "%s" STRING).

If the first argument is nil or the empty string, the function clears
any existing message; this lets the minibuffer contents show.  See
also ‘current-message’.

  Probably introduced at or before Emacs version 19.29.

#+end_example
** debug-on-error

#+begin_src emacs-lisp
  (describe-variable 'debug-on-error)
#+end_src

#+RESULTS:
#+begin_example
debug-on-error is a variable defined in ‘src/eval.c’.

Its value is t
Original value was nil

Non-nil means enter debugger if an error is signaled.
Does not apply to errors handled by ‘condition-case’ or those
matched by ‘debug-ignored-errors’.
If the value is a list, an error only means to enter the debugger
if one of its condition symbols appears in the list.
When you evaluate an expression interactively, this variable
is temporarily non-nil if ‘eval-expression-debug-on-error’ is non-nil.
The command ‘toggle-debug-on-error’ toggles this.
See also the variable ‘debug-on-quit’ and ‘inhibit-debugger’.

  You can customize this variable.
  Probably introduced at or before Emacs version 1.2.

#+end_example

#+begin_src emacs-lisp
  (setq debug-on-error t)
#+end_src

#+RESULTS:
: t

* stateyness
** save-excursion

#+begin_src emacs-lisp
  (describe-function #'save-excursion)
#+end_src

#+RESULTS:
#+begin_example
save-excursion is a special-form in ‘src/editfns.c’.

(save-excursion &rest BODY)

Save point, and current buffer; execute BODY; restore those things.
Executes BODY just like ‘progn’.
The values of point and the current buffer are restored
even in case of abnormal exit (throw or error).

If you only want to save the current buffer but not point,
then just use ‘save-current-buffer’, or even ‘with-current-buffer’.

Before Emacs 25.1, ‘save-excursion’ used to save the mark state.
To save the mark state as well as point and the current buffer, use
‘save-mark-and-excursion’.

  Probably introduced at or before Emacs version 20.1.
  This function has a ‘byte-compile’ property
    ‘byte-compile-save-excursion’.  See the manual for details.

#+end_example
* variables

** setq ([[id:A9B288C5-5358-4CA7-82CC-F2294AEFB057][is-an-assignment]])

#+begin_src emacs-lisp
  (describe-function #'setq)
#+end_src

#+RESULTS:
#+begin_example
setq is a special-form in ‘src/eval.c’.

(setq [SYM VAL]...)

Set each SYM to the value of its VAL.
The symbols SYM are variables; they are literal (not evaluated).
The values VAL are expressions; they are evaluated.
Thus, (setq x (1+ y)) sets ‘x’ to the value of ‘(1+ y)’.
The second VAL is not computed until after the first SYM is set, and so on;
each VAL can use the new value of variables set earlier in the ‘setq’.
The return value of the ‘setq’ form is the value of the last VAL.

  Probably introduced at or before Emacs version 1.12.
  This function has a ‘byte-compile’ property ‘byte-compile-setq’.
    See the manual for details.

#+end_example

* flow control

** condition-case
:PROPERTIES:
:ID:       0E00106D-1AED-4498-8A15-2511B9B7E830
:END:

#+begin_src emacs-lisp
  (describe-function #'condition-case)
#+end_src

#+RESULTS:
#+begin_example
condition-case is a special-form in ‘src/eval.c’.

(condition-case VAR BODYFORM &rest HANDLERS)

Regain control when an error is signaled.
Executes BODYFORM and returns its value if no error happens.
Each element of HANDLERS looks like (CONDITION-NAME BODY...)
or (:success BODY...), where the BODY is made of Lisp expressions.

A handler is applicable to an error if CONDITION-NAME is one of the
error’s condition names.  Handlers may also apply when non-error
symbols are signaled (e.g., ‘quit’).  A CONDITION-NAME of t applies to
any symbol, including non-error symbols.  If multiple handlers are
applicable, only the first one runs.

The car of a handler may be a list of condition names instead of a
single condition name; then it handles all of them.  If the special
condition name ‘debug’ is present in this list, it allows another
condition in the list to run the debugger if ‘debug-on-error’ and the
other usual mechanisms say it should (otherwise, ‘condition-case’
suppresses the debugger).

When a handler handles an error, control returns to the ‘condition-case’
and it executes the handler’s BODY...
with VAR bound to (ERROR-SYMBOL . SIGNAL-DATA) from the error.
(If VAR is nil, the handler can’t access that information.)
Then the value of the last BODY form is returned from the ‘condition-case’
expression.

The special handler (:success BODY...) is invoked if BODYFORM terminated
without signaling an error.  BODY is then evaluated with VAR bound to
the value returned by BODYFORM.

See also the function ‘signal’ for more info.

  Probably introduced at or before Emacs version 17.
  This function has a ‘byte-compile’ property
    ‘byte-compile-condition-case’.  See the manual for details.

#+end_example

* [[id:58037216-DD41-4C5F-AE7C-7A621EF9D319][lists]]

#+begin_src emacs-lisp
  (save-excursion
    (shortdoc 'list)
    (buffer-substring-no-properties (point-min) (point-max)))
#+end_src

#+RESULTS:
#+begin_example
Making Lists

(make-list length init)
  Return a newly created list of length LENGTH, with each element being INIT.
  (make-list 5 'a)
    ⇒ (a a a a a)


(cons car cdr)
  Create a new cons, give it CAR and CDR as components, and return it.
  (cons 1 '(2 3 4))
    ⇒ (1 2 3 4)


(list &rest objects)
  Return a newly created list with specified arguments as elements.
  (list 1 2 3)
    ⇒ (1 2 3)


(number-sequence from &optional to inc)
  Return a sequence of numbers from FROM to TO (both inclusive) as a list.
  (number-sequence 5 8)
    ⇒ (5 6 7 8)


(ensure-list object)
  Return OBJECT as a list.
  (ensure-list "foo")
    ⇒ ("foo")
  (ensure-list '(1 2 3))
    ⇒ (1 2 3)
  (ensure-list '(1 . 2))
    ⇒ (1 . 2)


(ensure-proper-list object)
  Return OBJECT as a list.
  (ensure-proper-list "foo")
    ⇒ ("foo")
  (ensure-proper-list '(1 2 3))
    ⇒ (1 2 3)
  (ensure-proper-list '(1 . 2))
    ⇒ ((1 . 2))

Operations on Lists

(append &rest sequences)
  Concatenate all the arguments and make the result a list.
  (append '("foo" "bar") '("zot"))
    ⇒ ("foo" "bar" "zot")


(copy-tree tree &optional vectors-and-records)
  Make a copy of TREE.
  (copy-tree '(1 (2 3) 4))
    ⇒ (1 (2 3) 4)


(flatten-tree tree)
  Return a "flattened" copy of TREE.
  (flatten-tree '(1 (2 3) 4))
    ⇒ (1 2 3 4)


(car list)
  Return the car of LIST.  If LIST is nil, return nil.
  (car '(one two three))
    ⇒ one
  (car '(one . two))
    ⇒ one
  (car nil)
    ⇒ nil


(cdr list)
  Return the cdr of LIST.  If LIST is nil, return nil.
  (cdr '(one two three))
    ⇒ (two three)
  (cdr '(one . two))
    ⇒ two
  (cdr nil)
    ⇒ nil


(last list &optional n)
  Return the last link of LIST.  Its car is the last element.
  (last '(one two three))
    ⇒ (three)


(butlast list &optional n)
  Return a copy of LIST with the last N elements removed.
  (butlast '(one two three))
    ⇒ (one two)


(nbutlast list &optional n)
  Modify LIST to remove the last N elements.
  (nbutlast (list 'one 'two 'three))
    ⇒ (one two)


(nth n list)
  Return the Nth element of LIST.
  (nth 1 '(one two three))
    ⇒ two


(nthcdr n list)
  Take cdr N times on LIST, return the result.
  (nthcdr 1 '(one two three))
    ⇒ (two three)


(take n list)
  Return the first N elements of LIST.
  (take 3 '(one two three four))
    ⇒ (one two three)


(ntake n list)
  Modify LIST to keep only the first N elements.
  (ntake 3 (list 'one 'two 'three 'four))
    ⇒ (one two three)


(take-while pred list)
  Return the longest prefix of LIST whose elements satisfy PRED.
  (take-while #'numberp '(1 2 three 4 five))
    ⇒ (1 2)


(drop-while pred list)
  Skip initial elements of LIST satisfying PRED and return the rest.
  (drop-while #'numberp '(1 2 three 4 five))
    ⇒ (three 4 five)


(any pred list)
  Non-nil if PRED is true for at least one element in LIST.
  (any #'symbolp '(1 2 three 4 five))
    ⇒ (three 4 five)


(all pred list)
  Non-nil if PRED is true for all elements in LIST.
  (all #'symbolp '(one 2 three))
    ⇒ nil
  (all #'symbolp '(one two three))
    ⇒ t


(elt sequence n)
  Return element of SEQUENCE at index N.
  (elt '(one two three) 1)
    ⇒ two


(car-safe object)
  Return the car of OBJECT if it is a cons cell, or else nil.
  (car-safe '(one two three))
    ⇒ one


(cdr-safe object)
  Return the cdr of OBJECT if it is a cons cell, or else nil.
  (cdr-safe '(one two three))
    ⇒ (two three)


(push newelt place)
  Add NEWELT to the list stored in the generalized variable PLACE.
  (push 'a list)
    → [it depends]


(pop place)
  Return the first element of PLACE’s value, and remove it from the list.
  (pop list)
    → [it depends]


(setcar cell newcar)
  Set the car of CELL to be NEWCAR.  Returns NEWCAR.
  (setcar list 'c)
    ⇒ c


(setcdr cell newcdr)
  Set the cdr of CELL to be NEWCDR.  Returns NEWCDR.
  (setcdr list (list c))
    ⇒ '(c)


(nconc &rest lists)
  Concatenate any number of lists by altering them.
  (nconc (list 1) (list 2 3 4))
    ⇒ (1 2 3 4)


(delq elt list)
  Delete members of LIST which are ‘eq’ to ELT, and return the result.
  (delq 'a (list 'a 'b 'c 'd))
    ⇒ (b c d)


(delete elt seq)
  Delete members of SEQ which are ‘equal’ to ELT, and return the result.
  (delete 2 (list 1 2 3 4))
    ⇒ (1 3 4)
  (delete "a" (list "a" "b" "c" "d"))
    ⇒ ("b" "c" "d")


(remq elt list)
  Return LIST with all occurrences of ELT removed.
  (remq 'b '(a b c))
    ⇒ (a c)


(remove elt seq)
  Return a copy of SEQ with all occurrences of ELT removed.
  (remove 2 '(1 2 3 4))
    ⇒ (1 3 4)
  (remove "a" '("a" "b" "c" "d"))
    ⇒ ("b" "c" "d")


(delete-dups list)
  Destructively remove ‘equal’ duplicates from LIST.
  (delete-dups (list 1 2 4 3 2 4))
    ⇒ (1 2 4 3)

Mapping Over Lists

(mapcar function sequence)
  Apply FUNCTION to each element of SEQUENCE, and make a list of the results.
  (mapcar #'list '(1 2 3))
    ⇒ ((1) (2) (3))


(mapcan function sequence)
  Apply FUNCTION to each element of SEQUENCE, and concatenate
  (mapcan #'list '(1 2 3))
    ⇒ (1 2 3)


(mapc function sequence)
  Apply FUNCTION to each element of SEQUENCE for side effects only.
  (mapc #'insert '("1" "2" "3"))
    ⇒ 123("1" "2" "3")


(seq-reduce function sequence initial-value)
  Reduce the function FUNCTION across SEQUENCE, starting with INITIAL-VALUE.
  (seq-reduce #'+ '(1 2 3) 0)
    ⇒ 6


(mapconcat function sequence &optional separator)
  Apply FUNCTION to each element of SEQUENCE, and concat the results as strings.
  (mapconcat #'identity '("foo" "bar") "|")
    ⇒ "foo|bar"

Predicates

(listp object)
  Return t if OBJECT is a list, that is, a cons cell or nil.
  (listp '(1 2 3))
    ⇒ t
  (listp nil)
    ⇒ t
  (listp '(1 . 2))
    ⇒ t


(consp object)
  Return t if OBJECT is a cons cell.
  (consp '(1 2 3))
    ⇒ t
  (consp nil)
    ⇒ nil


(proper-list-p object)
  Return OBJECT’s length if it is a proper list, nil otherwise.
  (proper-list-p '(1 2 3))
    ⇒ 3
  (proper-list-p nil)
    ⇒ 0
  (proper-list-p '(1 . 2))
    ⇒ nil


(null object)
  Return t if OBJECT is nil, and return nil otherwise.
  (null nil)
    ⇒ t


(atom object)
  Return t if OBJECT is not a cons cell.  This includes nil.
  (atom 'a)
    ⇒ t


(nlistp object)
  Return t if OBJECT is not a list.  Lists include nil.
  (nlistp '(1 2 3))
    ⇒ nil
  (nlistp t)
    ⇒ t
  (nlistp '(1 . 2))
    ⇒ nil

Finding Elements

(memq elt list)
  Return non-nil if ELT is an element of LIST.  Comparison done with ‘eq’.
  (memq 'b '(a b c))
    ⇒ (b c)


(memql elt list)
  Return non-nil if ELT is an element of LIST.  Comparison done with ‘eql’.
  (memql 2.0 '(1.0 2.0 3.0))
    ⇒ (2.0 3.0)


(member elt list)
  Return non-nil if ELT is an element of LIST.  Comparison done with ‘equal’.
  (member 2 '(1 2 3))
    ⇒ (2 3)
  (member "b" '("a" "b" "c"))
    ⇒ ("b" "c")


(member-ignore-case elt list)
  Like ‘member’, but ignore differences in case and text representation.
  (member-ignore-case "foo" '("bar" "Foo" "zot"))
    ⇒ ("Foo" "zot")

Association Lists

(assoc key alist &optional testfn)
  Return non-nil if KEY is equal to the car of an element of ALIST.
  (assoc "b" '(("a" . 1) ("b" . 2)))
    ⇒ ("b" . 2)


(rassoc key alist)
  Return non-nil if KEY is ‘equal’ to the cdr of an element of ALIST.
  (rassoc "b" '((1 . "a") (2 . "b")))
    ⇒ (2 . "b")


(assq key alist)
  Return non-nil if KEY is ‘eq’ to the car of an element of ALIST.
  (assq 'b '((a . 1) (b . 2)))
    ⇒ (b . 2)


(rassq key alist)
  Return non-nil if KEY is ‘eq’ to the cdr of an element of ALIST.
  (rassq 'b '((1 . a) (2 . b)))
    ⇒ (2 . b)


(assoc-string key list &optional case-fold)
  Like ‘assoc’ but specifically for strings (and symbols).
  (assoc-string "foo" '(("a" 1) (foo 2)))
    ⇒ (foo 2)


(alist-get key alist &optional default remove testfn)
  Find the first element of ALIST whose ‘car’ equals KEY and return its ‘cdr’.
  (alist-get 2 '((1 . a) (2 . b)))
    ⇒ b


(assoc-default key alist &optional test default)
  Find object KEY in a pseudo-alist ALIST.
  (assoc-default 2 '((1 . a) (2 . b) #'=))
    ⇒ b


(copy-alist alist)
  Return a copy of ALIST.
  (copy-alist '((1 . a) (2 . b)))
    ⇒ ((1 . a) (2 . b))


(assoc-delete-all key alist &optional test)
  Delete from ALIST all elements whose car is KEY.
  (assoc-delete-all "b" (list '("a" . a) '("b" . b) '("b" . c)))
    ⇒ (("a" . a))


(assq-delete-all key alist)
  Delete from ALIST all elements whose car is ‘eq’ to KEY.
  (assq-delete-all 2 (list '(1 . a) '(2 . b) '(2 . c)))
    ⇒ ((1 . a))


(rassq-delete-all value alist)
  Delete from ALIST all elements whose cdr is ‘eq’ to VALUE.
  (rassq-delete-all 'b (list '(1 . a) '(2 . b) '(2 . c)))
    ⇒ ((1 . a) (2 . c))

Property Lists

(plist-get plist prop &optional predicate)
  Extract a value from a property list.
  (plist-get '(a 1 b 2 c 3) 'b)
    ⇒ 2


(plist-put plist prop val &optional predicate)
  Change value in PLIST of PROP to VAL.
  (setq plist (plist-put plist 'd 4))
    e.g. ⇒ (a 1 b 2 c 3 d 4)


(plist-member plist prop &optional predicate)
  Return non-nil if PLIST has the property PROP.
  (plist-member '(a 1 b 2 c 3) 'b)
    ⇒ (b 2 c 3)

Data About Lists

(length sequence)
  Return the length of vector, list or string SEQUENCE.
  (length '(a b c))
    ⇒ 3


(length< sequence length)
  Return non-nil if SEQUENCE is shorter than LENGTH.
  (length< '(a b c) 1)
    ⇒ nil


(length> sequence length)
  Return non-nil if SEQUENCE is longer than LENGTH.
  (length> '(a b c) 1)
    ⇒ t


(length= sequence length)
  Return non-nil if SEQUENCE has length equal to LENGTH.
  (length= '(a b c) 3)
    ⇒ t


(safe-length list)
  Return the length of a list, but avoid error or infinite loop.
  (safe-length '(a b c))
    ⇒ 3
#+end_example

** list

#+begin_src emacs-lisp
  (describe-function #'list)
#+end_src

#+RESULTS:
#+begin_example
list is a primitive-function in ‘src/alloc.c’.

(list &rest OBJECTS)

Declared type: (function (&rest t) list)

Return a newly created list with specified arguments as elements.
Allows any number of arguments, including zero.

  Other relevant functions are documented in the list group.
  Probably introduced at or before Emacs version 1.2.
  This function does not change global state, including the match
    data.
  This function has a ‘byte-compile’ property ‘byte-compile-list’ and
    a byte-code optimizer ‘byte-optimize-list’.  See the manual for
    details.

#+end_example

* [[id:910846DE-0B6A-4CE4-A32E-3DE30642F744][alists]]

#+begin_src emacs-lisp
  (save-excursion
    (shortdoc 'alist)
    (buffer-substring-no-properties (point-min) (point-max)))
#+end_src

#+RESULTS:
#+begin_example
Alist Basics

(assoc key alist &optional testfn)
  Return non-nil if KEY is equal to the car of an element of ALIST.
  (assoc 'foo '((foo . bar) (zot . baz)))
    ⇒ (foo . bar)


(rassoc key alist)
  Return non-nil if KEY is ‘equal’ to the cdr of an element of ALIST.
  (rassoc 'bar '((foo . bar) (zot . baz)))
    ⇒ (foo . bar)


(assq key alist)
  Return non-nil if KEY is ‘eq’ to the car of an element of ALIST.
  (assq 'foo '((foo . bar) (zot . baz)))
    ⇒ (foo . bar)


(rassq key alist)
  Return non-nil if KEY is ‘eq’ to the cdr of an element of ALIST.
  (rassq 'bar '((foo . bar) (zot . baz)))
    ⇒ (foo . bar)


(assoc-string key list &optional case-fold)
  Like ‘assoc’ but specifically for strings (and symbols).
  (assoc-string "foo" '(("foo" . "bar") ("zot" "baz")))
    ⇒ ("foo" . "bar")

Manipulating Alists

(assoc-delete-all key alist &optional test)
  Delete from ALIST all elements whose car is KEY.
  (assoc-delete-all "b" (list '("a" . a) '("b" . b) '("b" . c)))
    ⇒ (("a" . a))


(assq-delete-all key alist)
  Delete from ALIST all elements whose car is ‘eq’ to KEY.
  (assq-delete-all 2 (list '(1 . a) '(2 . b) '(2 . c)))
    ⇒ ((1 . a))


(rassq-delete-all value alist)
  Delete from ALIST all elements whose cdr is ‘eq’ to VALUE.
  (rassq-delete-all 'b (list '(1 . a) '(2 . b) '(2 . c)))
    ⇒ ((1 . a) (2 . c))


(alist-get key alist &optional default remove testfn)
  Find the first element of ALIST whose ‘car’ equals KEY and return its ‘cdr’.
  (let ((foo '((bar . baz)))) (setf (alist-get 'bar foo) 'zot) foo)
    ⇒ ((bar . zot))

Misc

(assoc-default key alist &optional test default)
  Find object KEY in a pseudo-alist ALIST.
  (assoc-default "foobar" '(("foo" . baz)) #'string-match)
    ⇒ baz


(copy-alist alist)
  Return a copy of ALIST.
  (let* ((old '((foo . bar))) (new (copy-alist old))) (eq old new))
    ⇒ nil


(let-alist alist &rest body)
  Let-bind dotted symbols to their cdrs in ALIST and execute BODY.
  (let ((colors '((rose . red) (lily . white)))) (let-alist colors (if (eq .rose 'red) .lily)))
    ⇒ white
#+end_example

** assoc

#+begin_src emacs-lisp
  (describe-function #'assoc)
#+end_src

#+RESULTS:
#+begin_example
assoc is a primitive-function in ‘src/fns.c’.

(assoc KEY ALIST &optional TESTFN)

Return non-nil if KEY is equal to the car of an element of ALIST.
The value is actually the first element of ALIST whose car equals KEY.

Equality is defined by the function TESTFN, defaulting to ‘equal’.
TESTFN is called with 2 arguments: a car of an alist element and KEY.

  Other relevant functions are documented in the list and alist
  groups.
  Probably introduced at or before Emacs version 19.29.
  This function has a byte-code optimizer ‘byte-optimize-assoc’.  See
    the manual for details.

#+end_example

* structures

** cl-defstruct

#+begin_src emacs-lisp
  (describe-function #'cl-defstruct)
#+end_src

#+RESULTS:
#+begin_example
cl-defstruct is an autoloaded Lisp macro in ‘cl-macs.el’.

(cl-defstruct NAME &optional DOCSTRING &rest SLOTS)

Define a struct type.
This macro defines a new data type called NAME that stores data
in SLOTs.  It defines a ‘make-NAME’ constructor, a ‘copy-NAME’
copier, a ‘NAME-p’ predicate, and slot accessors named ‘NAME-SLOT’.
You can use the accessors to set the corresponding slots, via ‘setf’.

NAME is usually a symbol, but may instead take the form (NAME
OPTIONS...), where each OPTION is either a single keyword
or (KEYWORD VALUE) where KEYWORD can be one of ‘:conc-name’,
‘:constructor’, ‘:copier’, ‘:predicate’, ‘:type’, ‘:named’,
‘:initial-offset’, ‘:print-function’, ‘:noinline’, or ‘:include’.
See Info node ‘(cl)Structures’ for the description of the
options.

The first element in SLOTS can be a doc string.

The rest of the elements in SLOTS is a list of SLOT elements,
each of which should either be a symbol, or take the form (SNAME
SDEFAULT SOPTIONS...), where SDEFAULT is the default value of
that slot and SOPTIONS are keyword-value pairs for that slot.

Supported keywords for slots are:
- ‘:read-only’: If this has a non-nil value, that slot cannot be set via ‘setf’.
- ‘:documentation’: this is a docstring describing the slot.
- ‘:type’: the type of the field; currently only used for documentation.

To see the documentation for a defined struct type, use
C-h o or M-x cl-describe-type.

  Probably introduced at or before Emacs version 26.1.

#+end_example

* Environment

** getenv

#+begin_src emacs-lisp
  (describe-function #'getenv)
#+end_src

#+RESULTS:
#+begin_example
getenv is an interactive byte-code-function in ‘env.el’.

(getenv VARIABLE &optional FRAME)

Declared type: (function (string &optional frame) (or null string))

Get the value of environment variable VARIABLE.
VARIABLE should be a string.  Value is nil if VARIABLE is undefined in
the environment.  Otherwise, value is a string.

If optional parameter FRAME is non-nil, then it should be a
frame.  This function will look up VARIABLE in its ‘environment’
parameter.

Otherwise, this function searches ‘process-environment’ for
VARIABLE.  If it is not found there, then it continues the search
in the environment list of the selected frame.

  ‘getenv’ is also a generalized variable.
  Probably introduced at or before Emacs version 21.1.
  This function does not change global state, including the match data.

#+end_example

** setenv

#+begin_src emacs-lisp
  (describe-function #'setenv)
#+end_src

#+RESULTS:
#+begin_example
setenv is an interactive byte-code-function in ‘env.el’.

(setenv VARIABLE &optional VALUE SUBSTITUTE-ENV-VARS)

Set the value of the environment variable named VARIABLE to VALUE.
VARIABLE should be a string.  VALUE is optional; if not provided or
nil, the environment variable VARIABLE will be removed.

Interactively, a prefix argument means to unset the variable, and
otherwise the current value (if any) of the variable appears at
the front of the history list when you type in the new value.
This function always replaces environment variables in the new
value when called interactively.

SUBSTITUTE-ENV-VARS, if non-nil, means to substitute environment
variables in VALUE with ‘substitute-env-vars’, which see.
This is normally used only for interactive calls.

The return value is the new value of VARIABLE, or nil if
it was removed from the environment.

This function works by modifying ‘process-environment’.

As a special case, setting variable ‘TZ’ calls ‘set-time-zone-rule’ as
a side-effect.

  Probably introduced at or before Emacs version 19.1.

#+end_example

** mw/path

Provide helpers for working with PATHs as a list.

The utility of this is associated with things like membership tests
and moves this towards a [[id:7EA4F965-0CDF-4937-8C2F-B152685870F4][richer-model]].

Rather than add any composite operations here, that will just be left
to client code.

This could certainly be modeled as a more generic data structure but
right now that seems premature.

*** get

Get the path environment variable as a list of parsed options.

#+begin_src emacs-lisp
  (defun mw/path/get ()
    (split-string (getenv "PATH") ":"))
#+end_src

#+RESULTS:
: mw/path/get

**** Sandbox

#+begin_src emacs-lisp
  (mw/path/get)
#+end_src

#+RESULTS:
| /Users/mwhipple/.local/bin | /usr/bin | /bin | /usr/sbin | /sbin | /opt/homebrew/bin/ |

*** set

Set the path from a provided list.

#+begin_src emacs-lisp
  (defun mw/path/set (paths)
    (setenv "PATH" (string-join paths ":")))
#+end_src

#+RESULTS:
: mw/path/set

**** Sandbox

#+begin_src emacs-lisp
  (mw/path/set (cons "foo" (mw/path/get)))
#+end_src

#+RESULTS:
: foo:/Users/mwhipple/.local/bin:/usr/bin:/bin:/usr/sbin:/sbin:/opt/homebrew/bin/

*** delete

This is unlikely to be typically used but can at least help clean up
while messing around.

#+begin_src emacs-lisp
  (defun mw/path/delete (path)
    (mw/path/set (delete path (mw/path/get))))
#+end_src

#+RESULTS:
: mw/path/delete

**** Sandbox

#+begin_src emacs-lisp
  (mw/path/rm "foo")
#+end_src

#+RESULTS:
: /Users/mwhipple/.local/bin:/usr/bin:/bin:/usr/sbin:/sbin:/opt/homebrew/bin/

*** member

#+begin_src emacs-lisp
  (defun mw/path/member (path)
    (member path (mw/path/get)))
#+end_src

#+RESULTS:
: mw/path/member

**** Sandbox

#+begin_src emacs-lisp
  (mw/path/member "/usr/bin")
#+end_src

#+RESULTS:
| /usr/bin | /bin | /usr/sbin | /sbin | /opt/homebrew/bin/ |

#+begin_src emacs-lisp
  (mw/path/member "/ur/bin")
#+end_src

#+RESULTS:

*** cons

#+begin_src emacs-lisp
  (defun mw/path/cons (path)
    (mw/path/set (cons path (mw/path/get))))
#+end_src

#+RESULTS:
: mw/path/cons

**** Sandbox

#+begin_src emacs-lisp
  (mw/path/append "foo")
#+end_src

#+RESULTS:
: /Users/mwhipple/.local/bin:/usr/bin:/bin:/usr/sbin:/sbin:/opt/homebrew/bin/:foo

*** append

#+begin_src emacs-lisp
  (defun mw/path/append (path)
    (mw/path/set (append (mw/path/get) (list path))))
#+end_src

#+RESULTS:
: mw/path/append

* Filesystem

** default-directory ([[id:5BA060A7-6674-4523-BC6F-6D34C230B12B][is-a-cwd]])
:PROPERTIES:
:ID:       C3FDF080-68AF-4F2C-ACB7-0F53F8307EAB
:END:

#+begin_src emacs-lisp
  (describe-variable 'default-directory)
#+end_src

#+RESULTS:
#+begin_example
default-directory is a variable defined in ‘src/buffer.c’.

Its value is "/Users/mwhipple/memex/cabinet/"
Local in buffer emacs_lisp.org; global value is nil

Name of default directory of current buffer.
It should be an absolute directory name; on GNU and Unix systems,
these names start with "/" or "~" and end with "/".
To interactively change the default directory, use the command ‘cd’.

  Automatically becomes permanently buffer-local when set.
  This variable is safe as a file local variable if its value
  satisfies the predicate ‘stringp’.
  Probably introduced at or before Emacs version 1.11.

#+end_example


** file-in-directory-p

#+begin_src emacs-lisp
  (describe-function #'file-in-directory-p)
#+end_src

#+RESULTS:
#+begin_example
file-in-directory-p is a byte-code-function in ‘files.el’.

(file-in-directory-p FILE DIR)

Return non-nil if DIR is a parent directory of FILE.
Value is non-nil if FILE is inside DIR or inside a subdirectory of DIR.
A directory is considered to be a "parent" of itself.
DIR must be an existing directory, otherwise the function returns nil.

  Other relevant functions are documented in the file group.
  Probably introduced at or before Emacs version 24.1.

#+end_example

* generic functions

I'm going to use generic functions a lot with emacs-lisp since they
offer an enormously helpful way to reduce the conceptual footprint and
provide richer behaviors.

These tend not to be used heavily...I think potentially due to
performance reasons - but I'll cross that bridge if/when I come to it.
Emacs lisp also tends to understandably gravitate towards specialized
functionality which I'm likely to drag it a bit outside of.

These will typically include a [[id:3A3B17B9-0761-4DB1-A663-B12BC13155B4][context-argument]] to allow for a bit
more future-proofed multimethod support.

** cl-defgeneric
:PROPERTIES:
:ID:       654A5E2B-7B24-48CC-9B26-B15484B4F38C
:END:

#+begin_src emacs-lisp :results value
  (describe-function #'cl-defgeneric)
#+end_src

#+RESULTS:
#+begin_example
cl-defgeneric is a Lisp macro in ‘cl-generic.el’.

(cl-defgeneric NAME ARGS [DOC-STRING] [OPTIONS-AND-METHODS...] &rest
DEFAULT-BODY)

Create a generic function NAME.
DOC-STRING is the base documentation for this class.  A generic
function usually has no body, as its purpose is to decide which
method body is appropriate to use; ARGS are currently ignored if
there’s no body.  If BODY is present, it provides the default
implementation.
Specific implementation methods are defined with ‘cl-defmethod’.
OPTIONS-AND-METHODS currently understands:
- (:documentation DOCSTRING)
- (declare DECLARATIONS)
- (:argument-precedence-order &rest ARGS)
- (:method [QUALIFIERS...] ARGS &rest BODY)
DEFAULT-BODY, if present, is used as the body of a default method.

  Probably introduced at or before Emacs version 25.1.

#+end_example

** cl-defmethod
:PROPERTIES:
:ID:       F2F61FB6-88DE-4275-B318-3B42CA58D65D
:END:

#+begin_src emacs-lisp :results value
  (describe-function #'cl-defmethod)
#+end_src

#+RESULTS:
#+begin_example
cl-defmethod is a Lisp macro in ‘cl-generic.el’.

(cl-defmethod NAME [EXTRA] [QUALIFIER] ARGS &rest [DOCSTRING] BODY)

Define a new method for generic function NAME.
This defines an implementation of NAME to use for invocations
of specific types of arguments.

ARGS is a list of dispatch arguments (see ‘cl-defun’), but where
each variable element is either just a single variable name VAR,
or a list on the form (VAR TYPE).

For instance:

  (cl-defmethod foo (bar (format-string string) &optional zot)
    (format format-string bar))

The dispatch arguments have to be among the mandatory arguments, and
all methods of NAME have to use the same set of arguments for dispatch.
Each dispatch argument and TYPE are specified in ARGS where the corresponding
formal argument appears as (VAR TYPE) rather than just VAR.

The optional EXTRA element, on the form ‘:extra STRING’, allows
you to add more methods for the same specializers and qualifiers.
These are distinguished by STRING.

The optional argument QUALIFIER is a specifier that modifies how
the method is combined with other methods, including:
   :before  - Method will be called before the primary
   :after   - Method will be called after the primary
   :around  - Method will be called around everything else
The absence of QUALIFIER means this is a "primary" method.
The set of acceptable qualifiers and their meaning is defined
(and can be extended) by the methods of ‘cl-generic-combine-methods’.

ARGS can also include so-called context specializers, introduced by
‘&context’ (which should appear right after the mandatory arguments,
before any &optional or &rest).  They have the form (EXPR TYPE) where
EXPR is an Elisp expression whose value should match TYPE for the
method to be applicable.

The set of acceptable TYPEs (also called "specializers") is defined
(and can be extended) by the various methods of ‘cl-generic-generalizers’.

	Currently supported forms for TYPE:

Support for the catch-all t specializer which always matches.

Support for (head VAL) specializers.
These match if the argument is a cons cell whose car is ‘eql’ to VAL.

Support for (eql VAL) specializers.
These match if the argument is ‘eql’ to VAL.

Support for dispatch on types.
This currently works for built-in types and types built on top of records.

Support for (derived-mode MODE) specializers.
Used internally for the (major-mode MODE) context specializers.

Support for dispatch on types defined by ‘oclosure-define’.

Support for dispatch on derived types, i.e. defined with ‘cl-deftype’.

Support for dispatch on types defined by EIEIO’s ‘defclass’.

Support for (subclass CLASS) specializers.
These match if the argument is the name of a subclass of CLASS.

  Probably introduced at or before Emacs version 25.1.

#+end_example
* elisp-strings
:PROPERTIES:
:ID:       5DD46C39-060E-44A3-A144-7CC64BDA27FC
:END:

** group

#+begin_src emacs-lisp
  (save-excursion
    (shortdoc 'string)
    (buffer-substring-no-properties (point-min) (point-max)))
#+end_src

#+RESULTS:
#+begin_example
Making Strings

(make-string length init)
  Return a newly created string of length LENGTH, with INIT in each element.
  (make-string 5 ?x)
    ⇒ "xxxxx"


(string &rest characters)
  Concatenate all the argument characters and make the result a string.
  (string ?a ?b ?c)
    ⇒ "abc"


(concat &rest sequences)
  Concatenate all the arguments and make the result a string.
  (concat "foo" "bar" "zot")
    ⇒ "foobarzot"


(string-join strings &optional separator)
  Join all STRINGS using SEPARATOR.
  (string-join '("foo" "bar" "zot") " ")
    ⇒ "foo bar zot"


(mapconcat function sequence &optional separator)
  Apply FUNCTION to each element of SEQUENCE, and concat the results as strings.
  (mapconcat (lambda (a) (concat "[" a "]")) '("foo" "bar" "zot") " ")
    ⇒ "[foo] [bar] [zot]"


(string-pad string length &optional padding start)
  Pad STRING to LENGTH using PADDING.
  (string-pad "foo" 5)
    ⇒ "foo  "
  (string-pad "foobar" 5)
    ⇒ "foobar"
  (string-pad "foo" 5 45 t)
    ⇒ "--foo"


(mapcar function sequence)
  Apply FUNCTION to each element of SEQUENCE, and make a list of the results.
  (mapcar #'identity "123")
    ⇒ (49 50 51)


(format string &rest objects)
  Format a string out of a format-string and arguments.
  (format "This number is %d" 4)
    ⇒ "This number is 4"

Manipulating Strings

(substring string &optional from to)
  Return a new string whose contents are a substring of STRING.
  (substring "abcde" 1 3)
    ⇒ "bc"
  (substring "abcde" 2)
    ⇒ "cde"
  (substring "abcde" 1 -1)
    ⇒ "bcd"
  (substring "abcde" -4 4)
    ⇒ "bcd"


(string-limit string length &optional end coding-system)
  Return a substring of STRING that is (up to) LENGTH characters long.
  (string-limit "foobar" 3)
    ⇒ "foo"
  (string-limit "foobar" 3 t)
    ⇒ "bar"
  (string-limit "foobar" 10)
    ⇒ "foobar"
  (string-limit "fo好" 3 nil 'utf-8)
    ⇒ "fo"


(truncate-string-to-width str end-column &optional start-column padding ellipsis ellipsis-text-property)
  Truncate string STR to end at column END-COLUMN.
  (truncate-string-to-width "foobar" 3)
    ⇒ "foo"
  (truncate-string-to-width "你好bar" 5)
    ⇒ "你好b"


(split-string string &optional separators omit-empty trim)
  Split STRING into substrings bounded by matches for SEPARATORS.
  (split-string "foo bar")
    ⇒ ("foo" "bar")
  (split-string "|foo|bar|" "|")
    ⇒ ("" "foo" "bar" "")
  (split-string "|foo|bar|" "|" t)
    ⇒ ("foo" "bar")


(split-string-and-unquote string &optional separator)
  Split the STRING into a list of strings.
  (split-string-and-unquote "foo \"bar zot\"")
    ⇒ ("foo" "bar zot")


(split-string-shell-command string)
  Split STRING (a shell command) into a list of strings.
  (split-string-shell-command "ls /tmp/'foo bar'")
    ⇒ ("ls" "/tmp/foo bar")


(string-lines string &optional omit-empty keep-newlines)
  Split STRING into a list of lines.
  (string-lines "foo\n\nbar")
    ⇒ ("foo" "" "bar")
  (string-lines "foo\n\nbar" t)
    ⇒ ("foo" "bar")


(string-replace from-string to-string in-string)
  Replace FROM-STRING with TO-STRING in IN-STRING each time it occurs.
  (string-replace "foo" "bar" "foozot")
    ⇒ "barzot"


(replace-regexp-in-string regexp rep string &optional fixedcase literal subexp start)
  Replace all matches for REGEXP with REP in STRING.
  (replace-regexp-in-string "[a-z]+" "_" "*foo*")
    ⇒ "*_*"


(string-trim string)
  Trim STRING of leading and trailing white space.
  (string-trim " foo ")
    ⇒ "foo"


(string-trim-left string &optional regexp)
  Trim STRING of leading string matching REGEXP.
  (string-trim-left "oofoo" "o+")
    ⇒ "foo"


(string-trim-right string &optional regexp)
  Trim STRING of trailing string matching REGEXP.
  (string-trim-right "barkss" "s+")
    ⇒ "bark"


(string-truncate-left string length)
  If STRING is longer than LENGTH, return a truncated version.
  (string-truncate-left "longstring" 8)
    ⇒ "...tring"


(string-remove-suffix suffix string)
  Remove SUFFIX from STRING if present.
  (string-remove-suffix "bar" "foobar")
    ⇒ "foo"


(string-remove-prefix prefix string)
  Remove PREFIX from STRING if present.
  (string-remove-prefix "foo" "foobar")
    ⇒ "bar"


(string-chop-newline string)
  Remove the final newline (if any) from STRING.
  (string-chop-newline "foo\n")
    ⇒ "foo"


(string-clean-whitespace string)
  Clean up whitespace in STRING.
  (string-clean-whitespace " foo   bar   ")
    ⇒ "foo bar"


(string-fill string width)
  Try to word-wrap STRING so that it displays with lines no wider than WIDTH.
  (string-fill "Three short words" 12)
    ⇒ "Three short\nwords"
  (string-fill "Long-word" 3)
    ⇒ "Long-word"


(reverse seq)
  Return the reversed copy of list, vector, or string SEQ.
  (reverse "foo")
    ⇒ "oof"


(substring-no-properties string &optional from to)
  Return a substring of STRING, without text properties.
  (substring-no-properties (propertize "foobar" 'face 'bold) 0 3)
    ⇒ "foo"


(try-completion string collection &optional predicate)
  Return longest common substring of all completions of STRING in COLLECTION.
  (try-completion "foo" '("foobar" "foozot" "gazonk"))
    ⇒ "foo"

Unicode Strings

(string-glyph-split string)
  Split STRING into a list of strings representing separate glyphs.
  (string-glyph-split "Hello, 👼🏻🧑🏼‍🤝‍🧑🏻")
    ⇒ ("H" "e" "l" "l" "o" "," " " "👼" "🏻" "🧑" "🏼" "‍" "🤝" "‍" "🧑" "🏻")


(string-glyph-compose string)
  Compose STRING according to the Unicode NFC.
  (string-glyph-compose "Å")
    ⇒ "Å"


(string-glyph-decompose string)
  Decompose STRING according to the Unicode NFD.
  (string-glyph-decompose "Å")
    ⇒ "Å"

Predicates for Strings

(string-equal s1 s2)
  Return t if two strings have identical contents.
  (string-equal "abc" "abc")
    ⇒ t
  (string-equal "abc" "ABC")
    ⇒ nil


(string-equal-ignore-case string1 string2)
  Compare STRING1 and STRING2 case-insensitively.
  (string-equal-ignore-case "foo" "FOO")
    ⇒ t


(equal o1 o2)
  Return t if two Lisp objects have similar structure and contents.
  (equal "foo" "foo")
    ⇒ t


(cl-equalp x y)
  Return t if two Lisp objects have similar structures and contents.
  (cl-equalp "Foo" "foo")
    ⇒ t


(stringp object)
  Return t if OBJECT is a string.
  (stringp "a")
    ⇒ t
  (stringp 'a)
    ⇒ nil
  (stringp ?a)
    ⇒ nil


(string-or-null-p object)
  Return t if OBJECT is a string or nil.
  (string-or-null-p "a")
    ⇒ t
  (string-or-null-p nil)
    ⇒ t


(char-or-string-p object)
  Return t if OBJECT is a character or a string.
  (char-or-string-p ?a)
    ⇒ t
  (char-or-string-p "a")
    ⇒ t


(string-empty-p string)
  Check whether STRING is empty.
  (string-empty-p "")
    ⇒ t


(string-blank-p string)
  Check whether STRING is either empty or only whitespace.
  (string-blank-p " \n")
    ⇒ 0


(string-lessp string1 string2)
  Return non-nil if STRING1 is less than STRING2 in lexicographic order.
  (string-lessp "abc" "def")
    ⇒ t
  (string-lessp "pic4.png" "pic32.png")
    ⇒ nil
  (string-lessp "1.1" "1.2")
    ⇒ t


(string-greaterp string1 string2)
  Return non-nil if STRING1 is greater than STRING2 in lexicographic order.
  (string-greaterp "foo" "bar")
    ⇒ t


(string-version-lessp string1 string2)
  Return non-nil if S1 is less than S2, as version strings.
  (string-version-lessp "pic4.png" "pic32.png")
    ⇒ t
  (string-version-lessp "1.9.3" "1.10.2")
    ⇒ t


(string-collate-lessp s1 s2 &optional locale ignore-case)
  Return t if first arg string is less than second in collation order.
  (string-collate-lessp "abc" "abd")
    ⇒ t


(string-prefix-p prefix string &optional ignore-case)
  Return non-nil if STRING begins with PREFIX.
  (string-prefix-p "foo" "foobar")
    ⇒ t


(string-suffix-p suffix string &optional ignore-case)
  Return non-nil if STRING ends with SUFFIX.
  (string-suffix-p "bar" "foobar")
    ⇒ t

Case Manipulation

(upcase obj)
  Convert argument to upper case and return that.
  (upcase "foo")
    ⇒ "FOO"


(downcase obj)
  Convert argument to lower case and return that.
  (downcase "FOObar")
    ⇒ "foobar"


(capitalize obj)
  Convert argument to capitalized form and return that.
  (capitalize "foo bar zot")
    ⇒ "Foo Bar Zot"


(upcase-initials obj)
  Convert the initial of each word in the argument to upper case.
  (upcase-initials "The CAT in the hAt")
    ⇒ "The CAT In The HAt"

Converting Strings

(string-to-number string &optional base)
  Parse STRING as a decimal number and return the number.
  (string-to-number "42")
    ⇒ 42
  (string-to-number "deadbeef" 16)
    ⇒ 3735928559
  (string-to-number "2.5e+03")
    ⇒ 2500.0


(number-to-string number)
  Return the decimal representation of NUMBER as a string.
  (number-to-string 42)
    ⇒ "42"


(char-uppercase-p char)
  Return non-nil if CHAR is an upper-case character.
  (char-uppercase-p ?A)
    ⇒ t
  (char-uppercase-p ?a)
    ⇒ nil

Data About Strings

(length sequence)
  Return the length of vector, list or string SEQUENCE.
  (length "foo")
    ⇒ 3
  (length "avocado: 🥑")
    ⇒ 10


(string-width string &optional from to)
  Return width of STRING in columns when displayed in the current buffer.
  (string-width "foo")
    ⇒ 3
  (string-width "avocado: 🥑")
    ⇒ 11


(string-pixel-width string &optional buffer)
  Return the width of STRING in pixels.
  (string-pixel-width "foo")
    ⇒ 21
  (string-pixel-width "avocado: 🥑")
    ⇒ 79


(string-search needle haystack &optional start-pos)
  Search for the string NEEDLE in the string HAYSTACK.
  (string-search "bar" "foobarzot")
    ⇒ 3


(assoc-string key list &optional case-fold)
  Like ‘assoc’ but specifically for strings (and symbols).
  (assoc-string "foo" '(("a" 1) (foo 2)))
    ⇒ (foo 2)


(seq-position sequence elt &optional testfn)
  Return the (zero-based) index of the first element in SEQUENCE "equal" to ELT.
  (seq-position "foobarzot" ?z)
    ⇒ 6
#+end_example

** concat

#+begin_src emacs-lisp
  (describe-function #'concat)
#+end_src

#+RESULTS:
#+begin_example
concat is a primitive-function in ‘src/fns.c’.

(concat &rest SEQUENCES)

Declared type: (function (&rest sequence) string)

Concatenate all the arguments and make the result a string.
The result is a string whose elements are the elements of all the arguments.
Each argument may be a string or a list or vector of characters (integers).

Values of the ‘composition’ property of the result are not guaranteed
to be ‘eq’.

  Other relevant functions are documented in the string group.
  Probably introduced at or before Emacs version 19.20.
  This function does not change global state, including the match
    data.
  This function has a ‘byte-compile’ property ‘byte-compile-concat’
    and a byte-code optimizer ‘byte-optimize-concat’.  See the manual
    for details.

#+end_example

** describe-variable

#+begin_src emacs-lisp
  (describe-function #'describe-variable)
#+end_src

#+RESULTS:
#+begin_example
describe-variable is an autoloaded interactive byte-code-function in
‘help-fns.el’.

It is bound to C-h v, <f1> v and <help> v.
It can also be invoked from the menu: Help → Describe → Describe
Variable...

(describe-variable VARIABLE &optional BUFFER FRAME)

Display the full documentation of VARIABLE (a symbol).
Returns the documentation as a string, also.
If VARIABLE has a buffer-local value in BUFFER or FRAME
(default to the current buffer and current frame),
it is displayed along with the global value.

  Probably introduced at or before Emacs version 27.1.

#+end_example

